Ret640/bulk/mesh4/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 16;
method scotch;
//simpleCoeffs
//{
//     n   (128 1 1);
//     delta 0.001;
//}

// 2021-03-10, Oder: looks to me as noone of below is really needed, and
//                   manualCoeffs has probably a bug.
hierarchicalCoeffs
{
    n   (2 2 1);
    delta 0.001;
    order xyz;
}
metisCoeffs
{ 
    processorWeights
    (
        1
        1
        1
        1
    );
}
manualCoeffs
{
    dataFile "<fileName>";
    distributed no;
    roots ();
}
// ************************************************************************* //
